# -*- coding: utf-8 -*-

# 这个文件用来指定一些必要的参数
# 时间的单位都是秒

FGO窗口名 = u'命运-冠位指定 - MuMu模拟器'

进本时间 = 24.0 #36
出本时间 = 11.0 #14
换面时间 = 14.0
换人时间 = 6.0 #10
放技能后等待时间 = 2.5
放技能弹出选择目标窗口时间 = 1.0
放技能选择目标后等待时间 = 3.0
点掉羁绊结算窗口时间 = 2.6
点掉经验结算窗口时间 = 1.8
进入选卡界面时间 = 1.8
普通操作时间 = 0.3


# 这个设成True可以让你在同时干别的事情
# 但脚本切换窗口的时候你也在切换窗口
# 可能导致脚本错误跳出或者脚本异常
操作完后回到原来窗口 = True


# 宝具时间是我查表得到的，最好不要改
# 写英灵的名字请按下面的名字
# 如果在表里没有，自己测了时间加进去，向上取整

宝具时间 = {
    18: [
        '杀生院', '大英雄'
    ],
    17: [
        '弓凛', '教授', '水泥', '水B'
    ],
    16: [
        '武藏', '花嫁', '小太阳', '1001'
    ],
    15: [
        '旧剑', 'JK', '雷帝', '骑金时',
        '皇女', '齐格', '大番茄', '茶茶'
    ],
    14: [
        '闪闪', '弓海妈', '拿皇', '白枪',
        '小黑贞', '冲莫', '伊莉雅', '尼托',
        '艳后', '奶光'
    ],
    13: [
        '周黑鸭', '鲸贞姑', '红A', '艾蕾',
        '枪奶光', '小恩', '大帝', '龙马',
        '骑凛', '梅芙', '贤王', '童谣',
        '海妈', '杀师匠', '彭姐', 'BX',
        '天草', '魔神总司', 'Lip', '北斋'
    ],
    12: [
        '剑肯', '布姐', '枪玉', '脚后跟',
        '拉二', '大姐姐', '爱迪狮', '三藏',
        '杀牛肉丸', '女帝', '王哈', 'X',
        '狂黑贞', '黑狗', '仇R'
    ],
    11: [
        '猩猩', '小黑', '弓呆', '信长',
        '黑枪', '师匠', '船长', '大龙娘',
        '酒吞', '杰克', '狂兰', 'B叔',
        '茨木', '猪皮塔', '伯爵'
    ],
    10: [
        '大王', '小刚', '尼禄', '总司',
        '棉被', '剑式', '剑兰', '特总',
        '杀式'
    ],
    9: [
        'Lily', '芬恩', 'Raber', 'R姐',
        '阿福', '豆爸', 'C妈', '肯娘',
        '喵玉'
    ],
    8: [
        '小莫', '飞哥'
    ],
    7: [
        '罗马', '黑胡子', '幼帝', '马大',
        '小丑', '酋长', '金时'
    ],
    6: [
        '阿塔', '莎比', '微笑', '清姬',
        '吕布'
    ],
    5: [
        '血斧', '保罗'
    ]
}

servant_index_map = {
    '学妹-VR': 0,
    '学妹': 1,
    '棉被': 2,
    '黑呆': 3,
    'Lily': 4,
    '尼禄': 5,
    '飞哥': 6, '对不起': 6,
    '凯撒': 7,
    '彩笔': 8, '大王': 8,
    '元帅-saber': 9,
    '迪昂': 10,
    '红A': 11, '卫宫': 11,
    '闪闪': 12,
    '绿茶': 13,
    '阿塔': 14, '塔喵': 14,
    '二姐': 15,
    '大英雄': 16,
    '大狗': 17,
    '龙娘': 18,
    '武僧': 19,
    '旧狗': 20,
    '炎头': 21,
    '罗马': 22,
    'r姐': 23, 'R姐': 23,
    '乔老师': 24,
    '黑胡子': 25,
    '布妈': 26,
    '牛肉丸': 27,
    '幼帝': 28,
    '蛋糕': 29,
    '马大': 30,
    'c妈': 31, 'C妈': 31,
    '元帅-caster': 32,
    '安徒生': 33,
    '莎比': 34,
    '小丑': 35, '子安': 35,
    '莫扎特': 36,
    '孔明': 37,
    '法狗': 38,
    '小次郎': 39,
    '咒腕': 40,
    '大姐': 41,
    '荆轲': 42,
    '桑松': 43,
    '魅影': 44,
    '舞娘': 45,
    '大龙娘': 46,
    'b叔': 47, 'B叔': 47,
    '狂兰': 48, '长江': 48,
    '吕布': 49,
    '微笑': 50,
    '狗蛋': 51, '金时': 51,
    '大公': 52,
    '小牛': 53,
    '鬼舅': 54,
    '酋长': 55,
    '清姬': 56,
    '血斧': 57,
    '喵玉': 58,
    '白贞': 59,
    '月神': 60,
    'c龙娘': 61,
    '小玉': 62, '狐狸': 62,
    '大卫': 63,
    '赫叔': 64,
    '船长': 65,
    'r双子': 66,
    'c子': 67, 'C子': 67,
    '总司': 68,
    '信长': 69,
    '师匠': 70,
    '刷子': 71,
    '小刚': 72,
    'raber': 73,
    '童谣': 74,
    '杰克': 75,
    '小莫': 76,
    '特总': 77,
    '黑枪': 78,
    '豆爸': 79,
    '巴贝奇': 80,
    '杰基尔': 81,
    '肯娘': 82, '弗兰': 82,
    # '所罗门': 83,
    '周黑鸭': 84,
    '小太阳': 85,
    'X毛': 86,
    '芬恩': 87,
    '布姐': 88,
    '贝爷': 89, '狼叔': 89,
    '花嫁': 90, '嫁王': 90,
    '215': 91, '剑式': 91,
    '214': 92, '杀式': 92,
    '天草': 93,
    '阿福': 94,
    '幼闪': 95,
    '伯爵': 96,
    '南丁': 97,
    '黑狗': 98,
    '梅芙': 99,
    '海妈': 100,
    '罗摩': 101,
    '李书文': 102,
    '爱迪狮': 103,
    '萨满': 104,
    '比利': 105,
    '黑贞': 106,
    '小安': 107,
    '大帝': 108,
    '切嗣': 109,
    '百貌': 110,
    '太太': 111,
    '酒吞': 112,
    '三藏': 113,
    '奶光': 114,
    'r金时': 115,
    '茨木': 116,
    '疯魔': 117,
    '拉二': 118,
    '白枪': 119,
    '尼托': 120,
    '剑兰': 121,
    '小崔': 122, '崔悲伤': 122,
    '高文': 123,
    '静谧': 124,
    '米袋': 125,
    '小贝': 126,
    '大番茄': 127,
    '枪玉': 128,
    '弓呆': 129,
    'c玛丽': 130,
    'a双子': 131,
    '冲莫': 132,
    '杀师匠': 133,
    '枪清姬': 134,
    '尺马大': 135, '铁拳': 135,
    '伊莉雅': 136,
    '小黑': 137,
    's龙娘': 138,
    '艳后': 139,
    '枪公': 140,
    '小黑贞': 141,
    '弓凛': 142,
    '小恩': 143,
    '羽蛇神': 144, '大姐姐': 144,
    '贤王': 145,
    '安娜': 146, '幼R': 146,
    '仇R': 147,
    '豹人': 148, '大河': 148,
    # '提妈': 149,
    '梅林': 150,
    # '盖提亚': 151,
    # '医生': 152,
    '武藏': 153,
    '王哈': 154,
    'BX': 155,
    '教授': 156,
    '黑A': 157,
    '狼王': 158,
    '燕青': 159,
    '旧剑': 160,
    '土方': 161,
    '茶茶': 162,
    'Melt': 163,
    'Lip': 164,
    'JK': 165,
    'BB': 166,
    '杀生院': 167,
    # '大杀生院':168,
    '1001': 169,
    '媚娘': 170,
    '彭姐': 171,
    '哥伦布': 172,
    '老福': 173,
    '保罗': 174,
    '水泥': 175,
    '剑肯': 176,
    '杀尼托': 177,
    '狂信': 178,
    '女仆呆': 179,
    '弓海妈': 180,
    '枪奶光': 181,
    '骑凛': 182
}
